
const WORDS: { [key: number]: string[] } = {
  3: [
    'कमलं',
    'शालिनी',
    'मालिनी',
    'करणं',
    'शरणः',
    'समीरः',
    'मारुतः',
    'पठति',
    'लिखति',
    'समरः',
    'संगरः',
    'पठामः',
    'पठाम',
    'सपदि',
    'समया',
    'समयः',
    'शंकरः',
    'अनंतः',
    'अनंता',
    'परितः',
    'उभयं',
    'गणकं',
    'कुमुदं',
    'चटुलः',
    'चरमं',
    'चरणं',
    'पदवी',
    'विजयी',
    'विरामः',
    'विषयः',
    'शमनं',
    'संकरः',
    'मनसि'
  ],
  4: ["book", "cake", "door", "fish", "golf", "hook"],
  5: ["apple", "beach", "clown", "drama", "eagle", "flame"],
};

export const getWordsByLength = (length: number): string[] => {
  return WORDS[length] || [];
};

//export default WORDS;

// export const WORDS = [
//       'कमलं',
//       'शालिनी',
//       'मालिनी',
//       'करणं',
//       'शरणः',
//       'समीरः',
//       'मारुतः',
//       'पठति',
//       'लिखति',
//       'नीहारः',
//       'समरः',
//       'संगरः',
//       'पठामः',
//       'पठाम',
//       'सपदि',
//       'समया',
//       'समयः',
//       'शंकरः',
//       'अनंतः',
//       'अनंता',
//       'परितः',
//       'उभयं',
//       'गणकं',
//       'कुमुदं',
//       'चटुलः',
//       'चरमं',
//       'चरणं',
//       'पदवी',
//       'विजयी',
//       'विरामः',
//       'विषयः',
//       'शमनं',
//       'संकरः',
//       'मनसि'
//     ]

    // if ( WordLengthSelector.length === 4){
    //   WORDS = [
    //     'कमलिनी',
    //     'हिमालयः',
    //     'शमंतकः',
    //     'रामायणं',
    //     'वेदमाता',
    //     'तारकेशः',
    //     'समीपतः',
    //     'संभावना',
    //     'समीचीनं',
    //     'दिनमणिः',
    //     'सुंदरांगः'
    //   ]
    //   }
    //   if ( WordLengthSelector.length === 5){
    //   WORDS = [
    //     'कमलाकरः',
    //     'समीपतरं',
    //     'जैरघुराम',
    //     'महाभारतं',
    //     'तोषदायकं',
    //     'मेघवाहनः',
    //     'देवमंदिरं',
    //     'संकटहरः',
    //     'सुमनोवनं'
    //   ]
